# usage Brewfile
# `brew bundle` after `brew tap homebrew/bundle`
 
tap 'caskroom/homebrew-cask'
tap 'homebrew/versions'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'brona/iproute2mac'

brew 'node'
brew 'openssl'
brew 'wget'
brew 'git'
brew 'cmake'
brew 'curl'
brew 'iproute2mac'
brew 'zsh'
brew 'zsh-completions'

cask 'airmail-beta'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'brackets'
cask 'cheatsheet'
cask 'clipmenu'
cask 'dash'
cask 'dropbox'
cask 'filezilla'
cask 'flash'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'java'
cask 'keepingyouawake'
cask 'kindle'
cask 'macvim'
cask 'minecraft'
cask 'night-owl'
cask 'phpstorm'
cask 'skype'
cask 'sublime-text3'
cask 'the-unarchiver'
cask 'virtualbox'
