# usage Brewfile
# `brew bundle` after `brew tap homebrew/bundle`
 
tap 'caskroom/homebrew-cask'
tap 'caskroom/versions'
tap 'homebrew/binary'

brew 'openssl'
brew 'wget'
brew 'git'
brew 'gist'
brew 'cmake'
brew 'curl'
brew 'nmap'
brew 'mas'
brew 'jq'
brew 'screenfetch'
brew 'iproute2mac'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

cask 'appcleaner'
cask 'brackets'
cask 'cheatsheet'
cask 'dropbox'
cask 'franz'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2-beta'
cask 'java'
cask 'keepingyouawake'
cask 'kindle'
cask 'karabiner'
#cask 'mactex'
cask 'macvim'
cask 'minecraft'
cask 'night-owl'
cask 'phpstorm'
cask 'scroll-reverser'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'virtualbox'

# QuickLook Plugins
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlcolorcode'

#cask 'blu-ray-player'
#cask 'lyrics-master'
#cask 'magican'
#cask 'transmisson'
#cask 'parallels-desktop'
#cask 'wacom-intuos-tablet'

# AppStore Applications
mas 'LINE', id: 539883307
mas 'TweetDeck', id: 485812721
mas 'ForkLift', id: 412448059
#mas 'Veertu', id: 1024069033
