# usage Brewfile
# `brew bundle` after `brew tap homebrew/bundle`
 
tap 'caskroom/homebrew-cask'
tap 'caskroom/versions'
tap 'homebrew/binary'

brew 'bash-completions'
brew 'cmake'
brew 'curl'
brew 'git'
brew 'gist'
brew 'iproute2mac'
brew 'jq'
brew 'nmap'
brew 'mas'
brew 'openssl'
brew 'screenfetch'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# No Test 
# tar, unzip, ranger, tcpdump, vscode, remmina, anyenv, golang, adobereader, nginx, cmus, docker, atool

cask 'appcleaner'
cask 'brackets'
cask 'cheatsheet'
cask 'dropbox'
cask 'discord'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2-beta'
cask 'keepingyouawake'
cask 'karabiner'
cask 'scroll-reverser'
cask 'the-unarchiver'

# QuickLook Plugins
cask 'betterzipql'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlcolorcode'

# AppStore Applications
# mas 'TweetDeck', id: 485812721
# mas 'ForkLift', id: 412448059
